---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.Dispose
source: html/41af71a3-fcc6-a00b-5f9b-42db654b52ed.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.Dispose Method

Releases all resources used by the FabricationSaveJobOptions

## Syntax (C#)
```csharp
public void Dispose()
```